Namespace:   Autodesk.Revit.UI.Macros
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public override RibbonPanel CreateRibbonPanel(
	string tabName,
	string panelName
)
  Visual Basic
Public Overrides Function CreateRibbonPanel ( _
	tabName As String, _
	panelName As String _
) As RibbonPanel
  Visual C++
public:
virtual RibbonPanel^ CreateRibbonPanel(
	String^ tabName,
	String^ panelName
) override
 Parameters
  tabName
 Type:  System String
  panelName
 Type:  System String
 See Also
  ApplicationEntryPoint Class
  CreateRibbonPanel Overload
  Autodesk.Revit.UI.Macros Namespace